## handling mising value using sciket learn

In [1]:
import pandas as pd
import matplotlib as plt
import seaborn as sns

In [2]:
dataset=pd.read_csv(r"C:\Machine_Learning_Course\ML_Practice_Dataset_500.csv")

In [3]:
dataset.head(5)

,ID,Age,Salary,Department,Education_Level,Experience_Years,Purchased,Performance_Score
0,367,41.0,54444.022560,Support,PhD,3,No,86.631826
1,47,NaN,75323.249876,Sales,PhD,39,Yes,53.340217
2,79,57.0,36889.913924,IT,High School,2,No,66.698145
3,237,54.0,61698.365040,Marketing,PhD,37,Yes,74.467841
4,413,59.0,46823.603047,HR,Post-Graduate,31,Yes,64.070418

In [5]:
dataset.isnull().sum().sum()

np.int64(95)

In [7]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 500 non-null    int64
 1   Age                405 non-null    float64
 2   Salary             500 non-null    float64
 3   Department         500 non-null    object
 4   Education_Level    500 non-null    object
 5   Experience_Years   500 non-null    int64
 6   Purchased          500 non-null    object
 7   Performance_Score  500 non-null    float64
dtypes: float64(3), int64(2), object(3)
memory usage: 31.4+ KB

In [13]:
dataset.select_dtypes(include = "float64").columns

Index(['Age', 'Salary', 'Performance_Score'], dtype='object')

In [33]:
from sklearn.impute import SimpleImputer

In [25]:
#to find mean
si=SimpleImputer(strategy="mean")
#fit transform to fill the missing value in the dataset
ar=si.fit_transform(dataset[['Age', 'Salary', 'Performance_Score']]) #save in a variable

In [ ]:
new_dataset =pd.DataFrame(ar,columns=dataset.select_dtypes(include = "float64").columns) #show dataset filled with missing values

           Age        Salary  Performance_Score
0    41.000000  54444.022560          86.631826
1    38.518519  75323.249876          53.340217
2    57.000000  36889.913924          66.698145
3    54.000000  61698.365040          74.467841
4    59.000000  46823.603047          64.070418
..         ...           ...                ...
495  20.000000  34178.603949          79.767422
496  44.000000  29053.103535          73.969660
497  26.000000  40139.472826          82.805870
498  38.518519  21442.032490          84.366846
499  24.000000  68986.289724          78.536189

[500 rows x 3 columns]

In [ ]:
# #finding mean of a column
# dataset["age"].mean()